## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.cinema-keda will be created
+   resource "argocd_application" "cinema-keda" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "cinema-keda"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               chart           = "keda"
+               path            = "."
+               repo_url        = "https://kedacore.github.io/charts"
+               target_revision = "2.8.2"

+               helm {
+                   release_name = "keda"
                }
            }
        }
    }

  # argocd_application.cinema-robusta is tainted, so must be replaced
-/+ resource "argocd_application" "cinema-robusta" {
!       id      = "robusta" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 246 -> (known after apply)
            name             = "robusta"
!           resource_version = "5006005" -> (known after apply)
!           uid              = "03d466fa-1c85-40b4-ac29-8d2a12178782" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

-           destination {
-               namespace = "cinema" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }
+           destination {
+               namespace = "robusta"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
-                   values       = "" -> null
                    # (1 unchanged attribute hidden)

!                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema will be created
+   resource "argocd_application" "keda-scaledobject-cinema" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cron"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema"
                    }
                }
            }
        }
    }

  # argocd_project.cinema will be updated in-place
!   resource "argocd_project" "cinema" {
        id = "cinema"

!       spec {
            # (3 unchanged attributes hidden)

-           destination {
-               namespace = "cinema" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }
-           destination {
-               namespace = "cinema" -> null
-               server    = "https://kubernetes.default.svc" -> null
            }
-           destination {
-               namespace = "kube-system" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }
-           destination {
-               namespace = "loadtesting" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }
+           destination {
+               namespace = "robusta"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "cinema"
+               server    = "https://kubernetes.default.svc"
            }
+           destination {
+               namespace = "kube-system"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "loadtesting"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.robusta will be created
+   resource "kubernetes_namespace" "robusta" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "disabled"
            }
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-7bbw2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
